{   
    "loading": "Cargando",
    "experience and projects": "EXPERIENCIA Y PROYECTOS",
    "skills": "HABILIDADES",
    "hello": "Hola, soy Guille Ferriol",
    "presentation": "Ingeniero de software apasionado por la tecnología y la innovación, con el objetivo de enfrentar grandes desafíos y crear soluciones que dejen huella. Motivado a trabajar en proyectos que conducen cambios significativos y generan impacto real.",
    "work together": "Trabajemos juntos",
    "always learning": "Siempre aprendiendo",
    "libraries": "Lenguajes, Bibliotecas y Frameworks",
    "databases": "Bases de datos",
    "others": "Otros",
    "operating systems": "Sistemas Operativos",
    "technical skills": "Habilidades Técnicas",
    "soft skills": "Habilidades Blandas",
    "data manipulation": "Manipulación, visualización y procesamiento de datos",
    "dsa": "Estructuras de Datos y Algoritmos (DSA)",
    "design patterns": "Patrones de Diseño",
    "design principles": "Principios de Diseño (SOLID, KISS, YAGNI, GRASP)",
    "paradigms": "Programación Orientada a Objetos (OOP), Programación Funcional (FP) y Programación Lógica",
    "software architecture": "Arquitectura de Software",
    "system design": "Diseño de Sistemas",
    "languages": "Idiomas: Español y Inglés",
    "troubleshooting": "Solución de problemas y Pensamiento Crítico",
    "teamwork": "Trabajo en equipo y Empatía",
    "adaptability": "Adaptabilidad",
    "time management": "Gestión de tiempo y Organización",
    "architecture student": "Estudiante de Arquitectura",
    "cujae description": "Durante tres años en la CUJAE (Universidad Tecnológica de La Habana), estudié Arquitectura, donde desarrollé habilidades clave como el pensamiento estructurado, diseño orientado a soluciones y atención al detalle. Estas competencias hoy enriquecen mi trabajo como desarrollador de software, permitiéndome crear soluciones sólidas y funcionales con una visión integral del diseño.",
    "data scince student": "Estudiante de Ciencia de Datos",
    "matcom description": "Durante dos años en Matcom (Facultad de Matemáticas y Computación de la Universidad de La Habana), estudié Ciencia de Datos, adquiriendo habilidades como análisis estadístico, modelado predictivo y gestión de grandes volúmenes de datos. Este conocimiento potencia mi trabajo como desarrollador de software, ayudándome a crear soluciones basadas en datos y optimizar procesos mediante la lógica y el análisis.",
    "full stack developer": "Desarrollador Full Stack",
    "onbc description": "Trabajé durante un año en ONBC (Organización Nacional de Bufetes Colectivos), donde desarrollé sistemas administrativos y gestión de eventos. También implementé modelos de aprendizaje automático que optimizaron sus procesos, facilitando la toma de decisiones y mejorando la eficiencia operativa.",
    "frontend developer": "Desarrollador Frontend",
    "countigo description": "Actualmente trabajo en Countigo, donde he desarrollado aplicaciones web altamente complejas relacionadas con la televisión condicional. Utilizo tecnologías modernas como microfrontend, lo que me permite crear soluciones escalables y modulares, adaptadas a las demandas de proyectos avanzados.",
    "current time": "2024 - Presente",
    "law firm assurance": "Gestion de aseguramiento de la ONBC",
    "law firm assurance description": "Es un sistema de gestión enfocado en la optimización de procesos de aseguramiento y la centralización de la información. Integra un modelo de aprendizaje automático para mejorar la eficiencia y toma de decisiones, contribuyendo a una gestión más precisa y ágil.",
    "law firm assurance learning": "Aprendí sobre gestión de sistemas, integración de modelos de machine learning y optimización de procesos empresariales, mejorando mis habilidades en análisis de datos y desarrollo de soluciones tecnológicas.",
    "medicinal plant recommendation system": "Sistema de recomendaciones de plantas medicinales",
    "medicinal plant recommendation system description": "Es una aplicación de gestión de datos donde los usuarios ingresan sus síntomas y el sistema sugiere plantas que pueden ayudar en su recuperación. El enfoque está en brindar soluciones naturales personalizadas y accesibles para el bienestar.",
    "medicinal plant recommendation system learning": "Desarrollé habilidades en diseño de algoritmos de recomendación, procesamiento de datos de salud y creación de interfaces intuitivas, mejorando mis capacidades en inteligencia artificial y desarrollo de aplicaciones.",
    "suitetv description": "Es un sistema de gestión para una tienda de televisión condicional y sus productos, utilizando una arquitectura de microfrontends. Este enfoque permite una mayor modularidad y escalabilidad, optimizando la gestión de productos y servicios en un entorno digital dinámico.",
    "suitetv learning": "Adquirí experiencia en arquitecturas de microfrontends, gestión de sistemas escalables y desarrollo de aplicaciones web modulares, mejorando mis competencias en diseño de sistemas distribuidos y desarrollo frontend.",
    "countv description": "Es un sistema de gestión para canales de televisión condicional, diseñado para ser utilizado por diversas entidades en la administración de sus canales internos. Facilita el control y la personalización de los servicios ofrecidos, asegurando una gestión eficiente y flexible.",
    "countv learning": "Desarrollé habilidades en la gestión de sistemas de televisión condicional, diseño de plataformas escalables y desarrollo de interfaces para usuarios corporativos, mejorando mis capacidades en administración de contenido y soluciones tecnológicas personalizadas.",
    "my own x description": "Es un repositorio de GitHub donde implemento herramientas de software populares desde cero, con el objetivo de comprender a fondo su funcionamiento interno y mejorar mi conocimiento sobre desarrollo de software y arquitecturas.",
    "my own x learning": "Aprendí sobre implementación de algoritmos, estructuras de datos, y el funcionamiento de herramientas de software complejas, fortaleciendo mis habilidades en programación, análisis de sistemas y desarrollo de software a nivel profundo.",
    "software engineer skills": "Habilidades de ingeniería de software",
    "software engineer skills description": "Es un repositorio de GitHub donde compilo conceptos clave que todo desarrollador de software debería conocer, incluyendo patrones de diseño, estructuras de datos y algoritmos (DSA), y arquitectura de software, entre otros",
    "software engineer skills learning": "Profundicé en patrones de diseño, estructuras de datos avanzadas y principios de arquitectura de software, mejorando mis habilidades en desarrollo de software, resolución de problemas complejos y diseño de sistemas eficientes.",
    "programming problems solved": "Problemas de programación resueltos",
    "programming problems solved description": "Es un repositorio de GitHub donde guardo todos los problemas de programación que resuelvo, creando un archivo de soluciones y técnicas aplicadas para mejorar continuamente mi habilidad en resolución de problemas.",
    "programming problems solved learning": "Mejoré mis habilidades en algoritmos, estructuras de datos y técnicas de optimización, adquiriendo experiencia práctica en resolución de problemas complejos y fortaleciendo mi capacidad para pensar de manera lógica y eficiente.",
    "addictions": "Adicciones en La Habana Vieja",
    "addictions description": "Fue un estudio realizado en La Habana Vieja en junio de 2023, en el que se analizó el comportamiento de los precios de productos adictivos. El enfoque principal fue el análisis estadístico de las fluctuaciones de precios y su relación con factores socioeconómicos.",
    "addictions learning": "Adquirí habilidades en análisis estadístico, manejo de datos económicos y evaluación de tendencias de precios, mejorando mi capacidad para realizar estudios cuantitativos y analizar patrones en datos reales.",
    "climate change": "Estudio sobre el cambio climático",
    "climate change description": "Es un estudio estadístico sobre el cambio climático en Cuba, abarcando datos desde 1990 hasta 2022. Analiza patrones históricos de temperatura, precipitación y eventos extremos para comprender mejor las tendencias climáticas en la región.",
    "climate change learning": "Desarrollé habilidades en análisis de series temporales, visualización de datos climáticos y modelado estadístico, mejorando mi capacidad para interpretar datos históricos y evaluar tendencias ambientales de largo plazo.",
    "cinemapedia description": "es un proyecto de ejemplo para la creación de una aplicación móvil multiplataforma utilizando Flutter. Permite explorar y descubrir contenido cinematográfico de manera intuitiva, destacando las capacidades modernas del framework.",
    "cinemapedia learning": "Aprendí sobre desarrollo multiplataforma con Flutter, diseño de interfaces de usuario responsivas y gestión eficiente del estado, mejorando mi experiencia en la creación de aplicaciones móviles modernas y funcionales."
}