{   
    "loading": "Loading",
    "experience and projects": "EXPERIENCE AND PROJECTS",
    "skills": "SKILLS",
    "hello": "Hi, I'm Guille Ferriol",
    "presentation": "Sofware engineer passionate about technology and innovation, with the firm objective of facing great challenges and creating solutions that leave a mark. Motivated to work on projects that drive significant change and generate real impact.",
    "work together": "Let's work together",
    "always learning": "Always learning",
    "libraries": "Languages, Libraries and Frameworks",
    "databases": "Databases",
    "others": "Others",
    "operating systems": "Operating Systems",
    "technical skills": "Technical Skills",
    "soft skills": "Soft Skills",
    "data manipulation": "Data manipulation, visualization and processing",
    "dsa": "Data Structures and Algorithms (DSA)",
    "design patterns": "Design Patterns",
    "design principles": "Design Principles (SOLID, KISS, YAGNI, GRASP)",
    "paradigms": "Object Oriented Programming (OOP), Functional Programming (FP) and Logic Programming",
    "software architecture": "Software Architecture",
    "system design": "System Design",
    "languages": "Languages: Spanish and English",
    "troubleshooting": "Troubleshooting and Critical Thinking",
    "teamwork": "Teamwork and Empathy",
    "adaptability": "Adaptability",
    "time management": "Time Management and Organization",
    "architecture student": "Architecture Student",
    "cujae description": "For three years at CUJAE (Technological University of Havana), I studied Architecture, where I developed key skills such as structured thinking, solution-oriented design, and attention to detail. These competencies now enhance my work as a software developer, enabling me to create robust and functional solutions with a comprehensive design perspective.",
    "data scince student": "Data Science Student",
    "matcom description": "For two years at Matcom (Faculty of Mathematics and Computing at the University of Havana), I studied Data Science, gaining skills in statistical analysis, predictive modeling, and managing large datasets. This knowledge enhances my work as a software developer, enabling me to create data-driven solutions and optimize processes through logic and analysis.",
    "full stack developer": "Full Stack Developer",
    "onbc description": "I worked for a year at ONBC (National Organization of Collective Law Firms), where I developed administrative and event management systems. I also implemented machine learning models that streamlined their processes, enhanced decision-making, and improved operational efficiency.",
    "frontend developer": "Frontend Developer",
    "countigo description": "I currently work at Countigo, where I have developed highly complex web applications related to conditional television. I leverage modern technologies like microfrontend, enabling me to create scalable and modular solutions tailored to the demands of advanced projects.",
    "current time": "2024 - Present",
    "law firm assurance": "Law Firm Assurance Management System",
    "law firm assurance description": "It is a management system focused on the optimization of assurance processes and the centralization of information. It integrates a machine learning model to improve efficiency and decision making, contributing to more precise and agile management.",
    "law firm assurance learning": " I gained experience in system management, machine learning model integration, and business process optimization, enhancing my skills in data analysis and technological solution development.",
    "medicinal plant recommendation system": "Medicinal Plant Recommendation System",
    "medicinal plant recommendation system description": "It is a data management application where users enter their symptoms and the system suggests plants that can help in their recovery. The focus is on providing personalized and accessible natural solutions for well-being.",
    "medicinal plant recommendation system learning": "I developed skills in designing recommendation algorithms, processing health data and creating intuitive interfaces, improving my capabilities in artificial intelligence and application development.",
    "suitetv description": "It is a management system for a conditional television store and its products, using a microfrontend architecture. This approach allows for greater modularity and scalability, optimizing the management of products and services in a dynamic digital environment.",
    "suitetv learning": "I gained experience in microfrontend architectures, scalable system management, and modular web application development, enhancing my skills in distributed system design and frontend development.",
    "countv description": "It is a management system for conditional television channels, designed to be used by multiple entities to manage their internal channels. It facilitates control and customization of services, ensuring efficient and flexible management.",
    "countv learning": "I gained skills in managing conditional television systems, designing scalable platforms, and developing interfaces for corporate users, enhancing my abilities in content management and customized technological solutions.",
    "my own x description": "It is a GitHub repository where I implement popular software tools from scratch, aiming to understand their internal workings in depth and improve my knowledge of software development and architectures.",
    "my own x learning": "I learned about algorithm implementation, data structures, and the functioning of complex software tools, strengthening my skills in programming, system analysis, and deep software development.",
    "software engineer skills": "Software Engineer Skills",
    "software engineer skills description" : "It  is a GitHub repository where I compile essential concepts every software developer should know, including design patterns, data structures and algorithms (DSA), and software architecture, among others.",
    "software engineer skills learning": "I deepened my understanding of design patterns, advanced data structures, and software architecture principles, enhancing my skills in software development, problem-solving, and designing efficient systems.",
    "programming problems solved": "Programming Problems Solved",
    "programming problems solved description": "It is a GitHub repository where I store all the programming problems I solve, creating a collection of solutions and techniques applied to continuously improve my problem-solving skills.",
    "programming problems solved learning": "I enhanced my skills in algorithms, data structures, and optimization techniques, gaining practical experience in solving complex problems and strengthening my ability to think logically and efficiently.",
    "addictions": "Addictions in Old Havana",
    "addictions description": "It was a study conducted in Old Havana in June 2023, focusing on analyzing the price behavior of addictive products. The main focus was on statistical analysis of price fluctuations and their relation to socio-economic factors.",
    "addictions learning": "I gained skills in statistical analysis, economic data handling, and price trend evaluation, enhancing my ability to conduct quantitative studies and analyze patterns in real-world data.",
    "climate change": "Study of climante change",
    "climate change description": "It is a statistical study on climate change in Cuba, covering data from 1990 to 2022. It analyzes historical patterns of temperature, precipitation, and extreme events to better understand climate trends in the region.",
    "climate change learning": "I developed skills in time series analysis, climate data visualization, and statistical modeling, enhancing my ability to interpret historical data and evaluate long-term environmental trends.",
    "cinemapedia description": "It is a sample project for building a cross-platform mobile application using Flutter. It allows users to explore and discover cinematic content intuitively, showcasing the modern capabilities of the framework.",
    "cinemapedia learning": "I learned cross-platform development with Flutter, responsive UI design, and efficient state management, enhancing my experience in creating modern and functional mobile applications."
}